Embedfire-motor/ebf_motor_tutorial_code_stm32f407_jiaoyang/basis_part/F407/直流有刷减速电机串口控制/User/motor_control/bsp_motor_control.h
#ifndef __BSP_MOTOR_CONTROL_H
#define	__BSP_MOTOR_CONTROL_H

#include "stm32f4xx.h"
#include "./tim/bsp_general_tim.h"
#include "main.h"

/* 电机方向控制枚举 */
typedef enum
{
  MOTOR_FWD = 0,
  MOTOR_REV,
}motor_dir_t;

/* 设置速度（占空比） */
#define SET_FWD_COMPAER(ChannelPulse)     TIM2_SetPWM_pulse(PWM_CHANNEL_1,ChannelPulse)    // 设置比较寄存器的值
#define SET_REV_COMPAER(ChannelPulse)     TIM2_SetPWM_pulse(PWM_CHANNEL_2,ChannelPulse)    // 设置比较寄存器的值

/* 使能输出 */
#define MOTOR_FWD_ENABLE()      HAL_TIM_PWM_Start(&TIM_TimeBaseStructure,PWM_CHANNEL_1);
#define MOTOR_REV_ENABLE()      HAL_TIM_PWM_Start(&TIM_TimeBaseStructure,PWM_CHANNEL_2);

/* 禁用输出 */
#define MOTOR_FWD_DISABLE()     HAL_TIM_PWM_Stop(&TIM_TimeBaseStructure,PWM_CHANNEL_1);
#define MOTOR_REV_DISABLE()     HAL_TIM_PWM_Stop(&TIM_TimeBaseStructure,PWM_CHANNEL_2);

void set_motor_speed(uint16_t v);
void set_motor_direction(motor_dir_t dir);
void show_help(void);
void deal_serial_data(void);

#endif /* __LED_H */

